---
kind: type
id: T:Autodesk.Revit.DB.SpotDimensionType
source: html/06ffc197-308a-a350-6dd7-6f812e175bb6.htm
---
# Autodesk.Revit.DB.SpotDimensionType

A type element containing the properties of a spot elevation.

## Syntax (C#)
```csharp
public class SpotDimensionType : DimensionType
```